app/views/societies/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "discounts" ON "categories"."id" = "discounts"."category_id" WHERE "discounts"."society_id" = ?  [["society_id", 1]]
SELECT "discounts".* FROM "discounts" WHERE "discounts"."society_id" = ?  [["society_id", 1]]
---
      </tr>
      <tr><td> <% @society.categories.each do |category|%>
            <h5><%= link_to category.nombre, category %></h5><% end %></td>
        <td > <% @society.discounts.each do |discount|%>