app/controllers/details_controller.rb

SELECT "details".* FROM "details"
---
  def index
    @details = Detail.all