app/controllers/providers_controller.rb

SELECT "providers".* FROM "providers"
---
  def index
    @providers = Provider.all

INSERT INTO "providers" ("nit", "nombre", "departamento", "ciudad", "telefono", "direccion", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @provider = Provider.new(provider_params)

    respond_to do |format|
      if @provider.save

SELECT  "providers".* FROM "providers" WHERE "providers"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_provider
      @provider = Provider.find(params[:id])