app/controllers/purchase_receipts_controller.rb

  def index
    @purchase_receipts = PurchaseReceipt.all
---
SELECT "purchase_receipts".* FROM "purchase_receipts"

  def new
    @purchase_receipt = PurchaseReceipt.new
    @provider_options = Provider.all.map{ |u| [ u.nombre, u.id ] }
---
SELECT "providers".* FROM "providers"